{
  "source": "https://www.essentialfitness.co",
  "generatedAtISO": "2026-02-06T15:56:56.112Z",
  "posts": [
    {
      "slug": "the-joy-of-movement",
      "title": "Finding Joy in Movement: Beyond Traditional Fitness Goals",
      "date": "2025-01-12T11:24:30.000Z",
      "source": "https://www.essentialfitness.co/blog/the-joy-of-movement",
      "excerpt": "Finding Joy in Movement: Beyond Traditional Fitness Goals Jan 12 Written By Adam Pierre In a world obsessed with fitness metrics, we've lost sight of something far more valuable: the simple joy of mov..."
    },
    {
      "slug": "when-life-meets-iron-training-as-a-support-system-not-your-whole-system",
      "title": "When Life Meets Iron: Training as a Support System, Not Your Whole System",
      "date": "2024-12-14T16:52:01.000Z",
      "source": "https://www.essentialfitness.co/blog/when-life-meets-iron-training-as-a-support-system-not-your-whole-system",
      "excerpt": "When Life Meets Iron: Training as a Support System, Not Your Whole System Dec 14 Written By Adam Pierre Your strength training should enhance your life's journey, not compete with it. This fundamental..."
    },
    {
      "slug": "keepgettingup",
      "title": "Keep Getting Up!",
      "date": "2024-09-30T15:12:59.000Z",
      "source": "https://www.essentialfitness.co/blog/keepgettingup",
      "excerpt": "Keep Getting Up! Sep 30 Written By Adam Pierre I set a challenge at the beginning of the month #keepgettingup. The rules were simple. Do at least one Turkish Get Up or Get Up variation everyday in Sep..."
    },
    {
      "slug": "little-by-little",
      "title": "Little by Little, the bird builds its nest",
      "date": "2024-08-17T17:32:45.000Z",
      "source": "https://www.essentialfitness.co/blog/little-by-little",
      "excerpt": "Little by Little, the bird builds its nest Aug 17 Written By Adam Pierre Summer is ending, we’re transitioning into fall. Kids are headed back to school. Ours is starting her first year of PK3! So, I..."
    },
    {
      "slug": "stop-hiiting-yourself",
      "title": "Stop HIITing Yourself",
      "date": "2024-08-10T20:10:30.000Z",
      "source": "https://www.essentialfitness.co/blog/stop-hiiting-yourself",
      "excerpt": "Stop HIITing Yourself Training Methods Aug 10 Written By Adam Pierre “I played High School Football. I once scored four touchdowns in one game.” – Al Bundy I’m showing my age with this quote. But if y..."
    },
    {
      "slug": "breatheabilitypartii",
      "title": "Breathe Ability Part II, The Action",
      "date": "2024-08-03T12:00:00.000Z",
      "source": "https://www.essentialfitness.co/blog/breatheabilitypartii",
      "excerpt": "Breathe Ability Part II, The Action Aug 3 Written By Adam Pierre Last week, on Breathe Ability… Recap: There are 3 Elements to breathing. Biomechanical. Biochemical. Psychophysiological.Biomechanical..."
    },
    {
      "slug": "breathe-ability-part-i-the-knowledge",
      "title": "Breathe - Ability Part I, The Knowledge",
      "date": "2024-07-27T19:35:18.000Z",
      "source": "https://www.essentialfitness.co/blog/breathe-ability-part-i-the-knowledge",
      "excerpt": "Breathe - Ability Part I, The Knowledge Jul 27 Written By Adam Pierre One of the best tools available to you on the road to better fitness is right under your nose. You’ve had it your whole life, and..."
    },
    {
      "slug": "traintorecover",
      "title": "Train to Recover",
      "date": "2024-07-20T23:57:06.000Z",
      "source": "https://www.essentialfitness.co/blog/traintorecover",
      "excerpt": "Train to Recover Jul 20 Written By Adam Pierre Tibetan Unicorn Milk Last week, I talked about Heart Rate Variability and how it’s a great instrument for monitoring your recovery. This week, I want to..."
    },
    {
      "slug": "an-instrument-for-recovery",
      "title": "An Instrument for recovery - Heart Rate Variability",
      "date": "2024-07-12T18:50:22.000Z",
      "source": "https://www.essentialfitness.co/blog/an-instrument-for-recovery",
      "excerpt": "An Instrument for recovery - Heart Rate Variability Recovery ToolsRecovery Methods Jul 12 Written By Adam Pierre Every few years in the world of fitness, emerges ‘the next big thing’ that’s guaranteed..."
    },
    {
      "slug": "deeper-roots",
      "title": "Deeper Roots",
      "date": "2023-01-24T01:32:22.000Z",
      "source": "https://www.essentialfitness.co/blog/deeper-roots",
      "excerpt": "Deeper Roots Jan 23 Written By Adam Pierre Why do I train mostly with kettlebells? Besides the fact that they store pretty easily, I've gotten stronger in some areas and maintained strength in others..."
    },
    {
      "slug": "telling-aint-teaching",
      "title": "Telling Ain’t Teaching",
      "date": "2023-01-22T22:46:52.000Z",
      "source": "https://www.essentialfitness.co/blog/telling-aint-teaching",
      "excerpt": "Telling Ain’t Teaching Jan 22 Written By Adam Pierre I remember my first coaching gig. Being an uncle. My nephew, Mike, wanted to learn how to ride a bike. All his friends knew how and he was ready to..."
    },
    {
      "slug": "we-learn-to-move-by-moving",
      "title": "Play! We Learn to move by Moving",
      "date": "2023-01-22T22:42:50.000Z",
      "source": "https://www.essentialfitness.co/blog/we-learn-to-move-by-moving",
      "excerpt": "Play! We Learn to move by Moving Jan 22 Written By Adam Pierre \"The language of movement is not language… the language of movement is feel.\" - Grey Cook We learn to move by moving. Can you imagine how..."
    },
    {
      "slug": "check-the-windows-first",
      "title": "Check the windows, first",
      "date": "2023-01-17T11:30:00.000Z",
      "source": "https://www.essentialfitness.co/blog/check-the-windows-first",
      "excerpt": "Check the windows, first Jan 17 Written By Adam Pierre I was having a conversation with a client the other day about why we prep the way we prep before strength training. And it got me thinking. I rem..."
    },
    {
      "slug": "work-on-not-workout",
      "title": "Work on not workout",
      "date": "2023-01-16T02:08:00.000Z",
      "source": "https://www.essentialfitness.co/blog/work-on-not-workout",
      "excerpt": "Work on not workout Jan 15 Written By Adam Pierre \"Practice? Why do ya'll call it that? You're working out. Just call it a workout.\" I hear this often. A simple answer is, strength is a skill. For me,..."
    },
    {
      "slug": "why-train-barefoot",
      "title": "Why Train Barefoot?",
      "date": "2023-01-14T12:30:00.000Z",
      "source": "https://www.essentialfitness.co/blog/why-train-barefoot",
      "excerpt": "Why Train Barefoot? Jan 14 Written By Adam Pierre Many of us have all five of our senses. Sight, smell, sound, taste and touch/feel. This is how we receive information from our environment so that we..."
    },
    {
      "slug": "exercise-selection",
      "title": "How to Choose the Right Exercises",
      "date": "2023-01-14T12:27:40.000Z",
      "source": "https://www.essentialfitness.co/blog/exercise-selection",
      "excerpt": "How to Choose the Right Exercises Jan 14 Written By Adam Pierre So, I was talking with a new client the other day. We had just finished screening and were talking about goals. Then we started working..."
    },
    {
      "slug": "movement-patterns-vs-individual-muscles",
      "title": "Movement Patterns vs Individual Muscles",
      "date": "2023-01-13T20:49:55.000Z",
      "source": "https://www.essentialfitness.co/blog/movement-patterns-vs-individual-muscles",
      "excerpt": "Movement Patterns vs Individual Muscles Jan 13 Written By Adam Pierre If you wanted to learn to be a better driver. Would you get in your car. Start it up. And press the gas pedal for 3 sets of 10?If..."
    },
    {
      "slug": "lufreprcuq6mv7u0gep8mmti5y71za",
      "title": "Better planning",
      "date": "2023-01-13T20:40:47.000Z",
      "source": "https://www.essentialfitness.co/blog/lufreprcuq6mv7u0gep8mmti5y71za",
      "excerpt": "Better planning Jan 13 Written By Adam Pierre Something I've been thinking about a lot this year is planning and programming. Our daughter turned one this year. She's awesome. So fun and lively. And s..."
    }
  ]
}
